#+title: Sprint Backlog 01
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) spike(p) }

* Mission

- Provide a full layman's explanation the LIF model.

* Stories

** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75
#+CAPTION: Clock summary at [2015-09-08 Tue 18:17]
| <75>                                                                        |         |       |      |
| Headline                                                                    | Time    |       |      |
|-----------------------------------------------------------------------------+---------+-------+------|
| *Total time*                                                                | *11:08* |       |      |
|-----------------------------------------------------------------------------+---------+-------+------|
| Stories                                                                     | 11:08   |       |      |
| Active                                                                      |         | 11:08 |      |
| STARTED Sprint and product backlog grooming                                 |         |       | 0:14 |
| COMPLETED Write post on C++ implementation of Ohm's Law                     |         |       | 0:40 |
| COMPLETED Write a post on Capacitors and RC Circuits                        |         |       | 3:59 |
| COMPLETED Write a post on more advanced neuron morphology                   |         |       | 3:00 |
| STARTED Implement the capacitor's current differential equation in C++      |         |       | 3:15 |
#+end:

*** STARTED Sprint and product backlog grooming                       :story:
    CLOCK: [2015-09-03 Thu 07:51]--[2015-09-03 Thu 08:05] =>  0:14

Updates to sprint and product backlog.

*** COMPLETED Write post on C++ implementation of Ohm's Law           :story:
    CLOSED: [2015-09-05 Sat 18:48]
    CLOCK: [2015-09-03 Thu 08:05]--[2015-09-03 Thu 08:45] =>  0:40

Create a simple post describing the code for Ohm's Law.

*** COMPLETED Write a post on Capacitors and RC Circuits              :story:
    CLOSED: [2015-09-05 Sat 18:48]
    CLOCK: [2015-09-05 Sat 15:01]--[2015-09-05 Sat 19:00] =>  3:59

Finish up the post on RC Circuits, with possibly a link back to
neurons.

*** COMPLETED Write a post on more advanced neuron morphology         :story:
    CLOSED: [2015-09-08 Tue 18:16]
    CLOCK: [2015-09-05 Sat 20:48]--[2015-09-05 Sat 22:49] =>  2:01
    CLOCK: [2015-09-05 Sat 19:06]--[2015-09-05 Sat 20:05] =>  0:59

We need to start talking about:

- concentration gradient, voltage
- ions: channels and pumps

*** STARTED Implement the capacitor's current differential equation in C++ :story:
    CLOCK: [2015-09-08 Tue 15:01]--[2015-09-08 Tue 18:16] =>  3:15

We need to use odeint. We need to write a blog post describing it.

*** Consider writing a post about other neuron features

- high-level: mylin sheath, axon hillock, etc.
- lower level:
  - compartments
